import styles from '../styles/Home.module.css'

function Bio() {
    return (
        <div className={styles.container}>
            <div className="text-center sm:p-10 bg-gradient-to-b from-pink-100 to-red-300"><h1 className="text-3xl">Βιογραφικό</h1>
                <div className="grid sm:grid-cols-2 gap-2 p-10">
                    <img src="/photo.jpg" className="rounded-md" />
                    <div>
                        <p className='p-3 rounded-md text-justify border-double border-2 border-rose-500'>
                            Είμαι απόφοιτη του Τμήματος Ψυχολογίας του Παντείου Πανεπιστημίου Κοινωνικών και
                            Πολιτικών Επιστημών. Διαθέτω άδεια ασκήσεως επαγγέλματος (Αρ. 9886/ 08-07-2020).
                            <br />
                            <br />
                            Πραγματοποίησα την πρακτική μου άσκηση στο 1ο ΚΕΣΥ Γ΄ Αθήνας, όπου ως βοηθός ψυχολόγου
                            συμμετείχα στη διαγνωστική διαδικασία παιδιών προσχολικής ηλικίας με ευρύ φάσμα
                            δυσκολιών, όπως αυτισμός, νοητική υστέρηση κλπ. Η πτυχιακή μου εργασία αφορούσε τη
                            «σχέση της συναισθηματικής νοημοσύνης της μητέρας με το άγχος του έφηβου παιδιού της».
                            Καθ’ όλη τη διάρκεια των σπουδών μου έχω παρακολουθήσει πλήθος σεμιναρίων και ημερίδων
                            με ποικίλες θεματικές. Μετά το πέρας των σπουδών μου συνεχίζω την επιμόρφωσή μου με
                            σεμινάρια και εκπαιδεύσεις στη Σχολική και Κλινική Ψυχολογία, καθώς και στη Γνωσιακή
                            Συμπεριφορική Ψυχοθεραπεία (CBT) και τη Συνθετική Ψυχοθεραπεία.
                            <br />
                            <br />
                            Παράλληλα, υπήρξα Εθελόντρια Ψυχολόγος στο Σύλλογο ΓΟΝ.ΙΣ. για τη γονεϊκή ισότητα
                            και τα δικαιώματα του παιδιού στην Αθήνα, όπου παρείχα υπηρεσίες Ψυχοθεραπείας και
                            Συμβουλευτικής Γονέων. Ταυτόχρονα, αρθρογραφούσα ως ψυχολόγος στο psychoedu.gr, στο
                            οποίο παρείχα διαδικτυακή ψυχοεκπαίδευση και συμβουλευτική.
                            <br />
                            <br />
                            Στο παρόν ζω και εργάζομαι στο Άργος, Αργολίδας, όπου παρέχω ψυχολογική υποστήριξη
                            σε παιδιά προσχολικής, σχολικής και εφηβικής ηλικίας, καθώς και συμβουλευτική και
                            ψυχοεκπαίδευση σε γονείς στο Κέντρο Ειδικών θεραπειών "Το Μονοπάτι".
                        </p>
                    </div>
                </div>
            </div>
        </div>
    );
}

export default Bio;