import Image from "next/image";
import styles from '../styles/Home.module.css'

function Pros() {
        return (
            <div className={styles.container}>
                <div className="p-10 text-center bg-gradient-to-b from-pink-100 to-red-300">
                    <h1 className="p-5 text-4xl">Τρόπος Προσέγγισης</h1>
                    <Image src="/line.png" width={70} height={10} />
                    <p className="sm:p-5 text-justify border-double border-2 border-rose-500 rounded p-3">
                        <h2 className="text-2xl">Γνωσιακή Συμπεριφορική Ψυχοθεραπεία (CBT)</h2>
                        <br />
                        Η Γνωσιακή Συμπεριφορική Ψυ&shy;χο&shy;θε&shy;ραπεία αναπτύχθηκε το 1960 από τον Aaron T.
                        Beck. Είναι α&shy;πο&shy;δεδειγμένα αποτε&shy;λε&shy;σμα&shy;τική σε ένα ευρύ φάσμα ψυχιατρικών
                        δια&shy;τα&shy;ραχών, ψυ&shy;χο&shy;λογικών προβλημάτων και ιατρικών προβλημάτων με
                        ψυ&shy;χο&shy;λογικούς παράγοντες, όπως αγ&shy;χώδεις διαταραχές, διαταραχές δι&shy;άθεσης,
                        δι&shy;ατροφικές δι&shy;α&shy;τα&shy;ραχές, αυ&shy;τοάνοσα κ.ά.
                        <br />
                        <br />Η Γνωσιακή Συμπεριφορική Ψυ&shy;χο&shy;θεραπεία ασχολείται με τη σκέψη που θα
                        επιφέρει το συγκεκριμένο συ&shy;ναίσθημα και πα&shy;ρα&shy;τηρεί τη συμ&shy;περιφορά που θα
                        α&shy;κο&shy;λου&shy;θή&shy;σει. Σκοπός είναι να αλλάξει η αρνητική σκέψη, η δυσλειτουργική
                        συμ&shy;πε&shy;ριφορά και να αμβλυνθεί το συ&shy;ναίσθημα.
                        <br />
                        <br />
                        Πρόκειται για μια βραχεία θε&shy;ρα&shy;πεία. Είναι δομημένη, συγ&shy;κεκριμένη και
                        ε&shy;στιασμένη στην παρούσα δυσκολία με προ&shy;κα&shy;θο&shy;ρισμένο τέ&shy;λος. Η επιτυχία της
                        στηρίζεται στη συνεργατική σχέση θεραπευτή και θεραπευόμενου, διότι
                        ενθαρ&shy;ρύ&shy;νε&shy;ται η ενεργός συμμετοχή στη θε&shy;ραπεία του και ενισχύεται με την
                        ανάθεση εργασιών που θα πραγ&shy;ματοποιήσει στο σπίτι.
                        <br />
                        <br />Η Γνωσιακή Συμπεριφορική Θερα&shy;πεία εστιάζει σε δύο επίπεδα: στις
                        γνωσίες, δηλαδή στις σκέψεις που παράγει ένα άτομο και ακολούθως στη
                        συμπεριφορά, την αντίδραση, δηλαδή, σε κάποιο ε&shy;ρέθισμα. Η αν&shy;τίληψη των
                        ερεθισμάτων βασί&shy;ζεται στα σχήματα, τα οποία α&shy;ποτελούν νοητικές κατασκευές
                        που προ&shy;έρ&shy;χονται από τις πρώιμες παι&shy;δικές εμ&shy;πειρίες του ατόμου. Σύμ&shy;φωνα με
                        το μοντέλο αυτό, η σκέψη, το συναίσθημα και η συμ&shy;πε&shy;ριφορά αλληλεπιδρούν
                        συνεχώς σε ένα φαύλο κύκλο.
                        <br />
                        <br />
                        <div className="grid place-items-center">
                            <Image src={"/schema.png"} width={500} height={300} />
                        </div>
                        <h2 className="text-2xl">Συνθετική Ψυχοθεραπεία</h2>
                        <br />
                        Η Συνθετική Θεραπεία προάγει την ευ&shy;ε&shy;λιξία στον τρόπο που προσεγ&shy;γίζονται οι
                        δυσ&shy;κολίες των θερα&shy;πευ&shy;όμενων. Φέρνει στο επίκεντρο της διεργασίας τη
                        θε&shy;ρα&shy;πευτική σχέση και δίνει ιδιαίτερη βα&shy;ρύτητα και προ&shy;σοχή στη δημιουργία
                        και δι&shy;α&shy;τήρηση μιας στάσης αποδοχής, σε&shy;βασμού, εντιμότητας και εμ&shy;πι&shy;στο&shy;σύνης
                        προς τους θερα&shy;πευ&shy;ό&shy;μενους. Έχει ολιστικό χαρακτήρα με α&shy;πο&shy;τέλεσμα να αγγίζει
                        τους θε&shy;ρα&shy;πευ&shy;όμενους σε φυσικό, νοητικό, συ&shy;ναι&shy;σθηματικό και πνευματικό
                        επίπεδο.
                        <br />
                        <br />Δημιουργεί τις προϋποθέσεις, ώστε η κάθε συνεδρία να είναι μοναδική
                        με οδηγό την ενσυναισθητική σύν&shy;δεση στο εδώ και τώρα μεταξύ θεραπευτή και
                        θε&shy;ρα&shy;πευ&shy;ό&shy;μενου. Εί&shy;ναι η εμπειρία της συνθετικής ψυ&shy;χοθεραπείας που έχει ως
                        α&shy;πο&shy;τέ&shy;λεσμα την εσωτερική ανάπτυξη και θεραπεία σε όλα τα επίπεδα.
                        Ταυτόχρονα, δημιουργεί θε&shy;ρα&shy;πευ&shy;τικό χώρο τόσο για το θεραπευτή όσο και για
                        το θεραπευόμενο.
                        <br />
                        <br />Η Συνθετική Προσέγγιση επιλεγεί από δι&shy;αφορετικές προσεγγίσεις,
                        τεχνικές και στρα&shy;τηγικές ανάλογα τι είναι κατάλληλο για τον καθένα. Έτσι
                        το άτομο αρχίζει να κα&shy;τα&shy;λαβαίνει πώς έχει ερμηνεύσει κά&shy;ποια γεγονότα βάση
                        του γνωσιακού του χάρτη, έρχεται σε επαφή με τα συναισθήματα του
                        αναγνωρίζοντας τα και βιώνοντας τα στο εύρος και στο βάθος που χρειάζεται
                        και τε&shy;λικά προσπαθεί να εφαρμόσει στην συμ&shy;περιφορά του αυτά που έχει
                        κα&shy;τανοήσει σε επίπεδο σκέψης και συ&shy;ναι&shy;σθή&shy;ματος δοκιμάζοντας πιο βοηθητικές
                        προσ&shy;εγ&shy;γίσεις στο ε&shy;κάστοτε ζήτημα που το α&shy;πα&shy;σχολεί.
                    </p>
                </div>
            </div>
        );
    }

export default Pros;