import React, {Component} from "react";
import Image from "next/image";
import styles from '../styles/Home.module.css'

class Pros extends Component {
    state = {  } 
    render() { 
        return (
            <div className={styles.container}>
            <div className="p-10 text-center bg-gradient-to-b from-pink-100 to-red-400">
                <h1 className="p-5 text-2xl">Τρόπος Προσέγγισης</h1>
                <Image src="/line.png" width={70} height={10}/>
                <p className="sm:p-5 text-justify">
Η Γνωσιακή-Συμπεριφοριστική Θεραπεία (CBT) είναι μία ψυχοθεραπευτική προσέγγιση που 
αναπτύχθηκε από τον Aaron T. Beck την δεκαετία του 1960. Πρόκειται για μια επιστημονικά 
τεκμηριωμένη παρέμβαση, καθώς αποδεδειγμένα έχει φανεί από έρευνες πως είναι 
αποτελεσματική σε πλήθος προβλημάτων.
<br/>
<br/>Χαρακτηριστικό είναι πως επικεντρώνεται στο εδώ και τώρα, χωρίς όμως 
να αψηφά το ιστορικό του ατόμου. Είναι μια δομημένη, συνεργατική και βραχείας διάρκειας 
παρέμβαση. Ο θεραπευόμενος αναλαμβάνει ενεργητικό ρόλο στην διαδικασία και δρα επί 
ίσοις όροις με τον θεραπευτή με γνώμονα τις ανάγκες του πρώτου. Παράλληλα, εκπαιδεύεται 
ώστε να γίνει ο ίδιος «θεραπευτής» του εαυτού του, αξιοποιώντας τις ευεργετικές για 
εκείνον τεχνικές κι έξω από την θεραπευτική συνεδρία, αλλά και μετά το τέλος της θεραπείας.
<br/>
<br/>
Η Γνωσιακή-Συμπεριφοριστική Θεραπεία εστιάζει σε δύο επίπεδα, στις γνωσίες, δηλαδή 
στις σκέψεις που παράγει ένα άτομο, καθώς και στην συμπεριφορά, την αντίδραση του σε 
κάποιο ερέθισμα. Η αντίληψη των ερεθισμάτων βασίζεται στα σχήματα, νοητικές κατασκευές 
που προέρχονται από τις πρώιμες παιδικές εμπειρίες του ατόμου. Σύμφωνα με το μοντέλο 
αυτό, η σκέψη, το συναίσθημα και η συμπεριφορά αλληλεπιδρούν συνεχώς.
<br/>
<br/>Στόχος είναι η αναγνώριση και τροποποίηση των δυσλειτουργικών σκέψεων και 
συμπεριφορών.  Μετά το πρωταρχικό αίτημα, ξεκινά η λήψη ιστορικού και η αξιολόγηση με 
στόχο την δημιουργία των θεραπευτικών στόχων, οι οποίοι θα κατευθύνουν την θεραπευτική 
διαδικασία.</p>
            </div>
            </div>
        );
    }
}
 
export default Pros;